{
	"@metadata": {
		"authors": []
	},
	"createpage-here": "Used as $1 on {{msg-mw|createpage-alternate-creation}}.",
	"createpage-alternate-creation": "Shown on Special:CreatePage (and on regular ?action=edit links as well in the \"red link mode\"), below the {{msg-mw|createpage-title-additional}} text. $1 is {{msg-mw|createpage-edit-normal}}.",
	"createpage-edit-normal": "JavaScript dialog title; also used as a button text. Dialog contents are {{msg-mw|createpage-advanced-warning}}.",
"createpage-upload": "Upload image",
	"createpage-hide": "Clickable text shown in the fieldset legend element of the createplate chooser as well as infoboxes (if any); clicking on this hides the thing (createplate chooser or infobox) and then the text is changed into {{msg-mw|createpage-show}}.",
	"createpage-show": "Clickable text shown in the fieldset legend element of the createplate chooser as well as infoboxes (if any); clicking on this shows the hidden thing (createplate chooser or infobox) and then the text is changed into {{msg-mw|createpage-hide}}.",
	"createpage": "Page title for Special:CreatePage, as shown on [[Special:SpecialPages]]",
	"createpage-title": "Page title for Special:CreatePage, as shown on the page itself",
	"createpage-title-additional": "Shown on Special:CreatePage above the editor instead of {{msg-mw|newarticletext}} or {{msg-mw|newarticletextanon}}. Also shown on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration above {{msg-mw|newarticletext}} or {{msg-mw|newarticletextanon}}. (TODO: This is stupid, we should fix this.)",
	"createpage-title-caption": "Label for the title validator input, into which the user should give the name of the page that they want to create.",
	"createpage-choose-createplate": "Used as legend for the createplate selector on Special:CreatePage (and also on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration).",
	"createpage-button-createplate-submit": "Used on Special:CreatePage for users who do not have JavaScript enabled so that they can switch between createplates",
	"createpage-give-title": "Error message shown via the JavaScript title validator if a user fails to supply a page title; also shown without JS if the Special:CreatePage form is POSTed with the Createtitle parameter being absent.",
	"createpage-title-invalid": "Error message shown via the JavaScript title validator if a user supplies a page title that is not a valid page title in MediaWiki.",
	"createpage-article-exists": "Error message shown via the JavaScript title validator if a user supplies a page title that is the name of an existing page. This message is followed by an edit link to the existing page, and then the {{msg-mw|createpage-article-exists2}} message. (Yes, LEGO message construction, I know; it's awful.)",
	"createpage-article-exists2": "Error message shown via the JavaScript title validator if a user supplies a page title that is the name of an existing page. This message is preceded by the {{msg-mw|createpage-article-exists2}} message, which in turn is followed by an edit link to the existing page before this message. (Yes, LEGO message construction, I know; it's awful.)",
	"createpage-advanced-warning": "Shown via JavaScript if the user clicks either on the button or link text to use the advanced (regular wikitext) editor. The dialog contains two buttons, {{msg-mw|createpage-yes}} and {{msg-mw|createpage-no}}, which either perform the requested action or dismiss the dialog without taking any action, respectively.",
"createpage-login-warning": "By logging in now, you may lose all your unsaved text. Do you want to continue?",
	"createpage-infobox-legend": "Used as legend for the infobox fieldset on Special:CreatePage (and also on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration) if a createplate has an infobox.",
	"createpage-yes": "Used in various JavaScript dialogs together with messages like {{msg-mw|createpage-advanced-warning}} and {{msg-mw|createpage-login-warning}}. When the user clicks on this button, they may risk losing data.",
	"createpage-no": "Used in various JavaScript dialogs together with messages like {{msg-mw|createpage-advanced-warning}} and {{msg-mw|createpage-login-warning}}. When the user clicks on this button, they dialog is dismissed and no action is taken, ensuring that the user will not lose any unsaved data.",
	"createpage-categories": "Shown right above the category tag cloud on Special:CreatePage (and also on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration)",
	"createpage-addcategory": "Button text",
	"createpage-top-of-page": "TODO: I'm not sure how this is used. It technically seems to be used, but I'm unsure if it's actually ever displayed to the end-user.",
	"createpage-uploaded-from": "Summary used for images uploaded via Special:CreatePage",
	"createplate-list": "Newline-separated listing of createplates. The format is: <code>createplate internal name|Text displayed to the user</code>. For example, <code>foo|Bar</code> would mean that the user is shown the text \"Bar\" and it loads the createplate from <code>MediaWiki:Createplate-foo</code>.",
	"createplate-Blank": "{{notranslate}}",
	"createpage-title-check-header": "Title of an error message dialog shown via JavaScript. Contents of the dialog are {{msg-mw|createpage-title-check-text}}. The dialog is shown to the user when the page title they supplied is being validated but the validation hasn't yet finished.",
	"createpage-title-check-text": "Error message shown via the JavaScript title validator when a title is being validated but the validation hasn't yet finished. The title of the dialog is {{msg-mw|createpage-title-check-header}}.",
	"createpage-img-uploaded": "Shown on Special:CreatePage once an image has been successfully uploaded.",
	"createpage-preview-end": "Shown on Special:CreatePage (and also on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration) when previewing content, right below the content and above the editor.",
	"createpage-insert-image": "Button text; <code>&lt;!---imageupload---&gt;</code> in a createplate is transformed into this button, and clicking on this opens up a media picker, allowing the user to choose an image to upload. The upload summary/file page contents can be found at {{msg-mw|createpage-uploaded-from}}.",
	"createpage-upload-aborted": "Error message shown on Special:CreatePage when the user tries to upload an image but the image upload fails for whatever reason.",
	"createpage-initial-run": "Button text; clicking on this button dismisses the overlay and enables the editor on Special:CreatePage (and also on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration).",
	"createpage-login-required": "Error message shown via JavaScript to anon users who try to upload images via the Special:CreatePage interface. This is followed by {{msg-mw|createpage-login-href}} (which is magically turned into a clickable link, which takes the user to [[Special:UserLogin]]) and {{msg-mw|createpage-login-required2}}. (Yes, LEGO message construction, I know; it's awful.)",
	"createpage-login-href": "Refer to {{msg-mw|createpage-login-required}} for documentation about how this message is used.",
	"createpage-login-required2": "Refer to {{msg-mw|createpage-login-required}} for documentation about how this message is used.",
	"createpage-please-wait": "Used as an <code>alt</code> text on a progress bar image element; realistically only users with a super-slow Internet connection will ever see this",
	"createpage-upload-directory-read-only": "Error message shown via JavaScript if for some reason CreateAPage is installed and a user tries to upload an image via the upload form on Special:CreatePage, but the upload directory is not writable by the webserver",
	"headline-tip-3": "UNUSED, REMOVE ME EVENTUALLY.",
	"createpage-about-info": "Text shown on Special:CreatePage when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration and a user follows a red link, which then takes them to the Special:CreatePage-like editor, which however is not technically Special:CreatePage, it just looks literally like Special:CreatePage.",
	"createpage-advanced-text": "$1 is {{msg-mw|createpage-advanced-edit}}",
	"createpage-advanced-edit": "Link title, see {{msg-mw|createpage-advanced-text}}",
	"createpage-optionals-text": "Shown on Special:CreatePage (and also on regular ?action=edit links when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration) if a createplate contains optional sections that the user can choose to add, but which aren't considered mandatory.",
	"createpage-save": "Button text",
	"createpage-must-specify-title": "Error message displayed via JavaScript if the user tries to go the regular editing mode (?action=edit) from Special:CreatePage without specifying a title for the new page that they want to create.",
	"createpage-unsaved-changes": "JavaScript dialog title; dialog contents are {{msg-mw|createpage-unsaved-changes-details}}.",
	"createpage-unsaved-changes-details": "JavaScript dialog contents; the title of the dialog is {{msg-mw|createpage-unsaved-changes}}.",
	"tog-createpage-redlinks": "Shown on [[Special:Preferences]] when <code>$wgCreatePageCoverRedLinks</code> is set to <code>true</code> in the wiki's configuration. This option enables the use of Special:CreatePage-like editor on '''all''' redlinks.",
	"createpage-template-infobox-format": "Regular expression passed to PHP's [https://www.php.net/manual/en/function.preg-match-all.php <code>preg_match_all</code>] function; used to identify infobox templates (because especially in English infobox template naming conventions usually follow the pattern \"Infobox <subject>\")."
}